In [6]:
import numpy as np
import pandas as pd

In [7]:
d=pd.read_csv(r"C:\Users\KIIT0001\Downloads\orders.csv")#date
t=pd.read_csv(r"C:\Users\KIIT0001\Downloads\messages.csv")#time

In [8]:
d.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [9]:
t.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [10]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [11]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [12]:
#converting to datetime datatype

d['date']=pd.to_datetime(d['date'])
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [13]:
d['date_year']=d['date'].dt.year
d['date_month_no']=d['date'].dt.month
d['date_month_name']=d['date'].dt.month_name()
d['date_day']=d['date'].dt.day
d['date_dow']=d['date'].dt.dayofweek
d['date_dow_name']=d['date'].dt.day_name()

d.drop(columns=['product_id','city_id','orders']).head(10)

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday
5,2018-08-23,2018,8,August,23,3,Thursday
6,2018-11-21,2018,11,November,21,2,Wednesday
7,2019-03-27,2019,3,March,27,2,Wednesday
8,2019-06-29,2019,6,June,29,5,Saturday
9,2018-08-30,2018,8,August,30,3,Thursday

In [14]:
d['date_is_weekend']=np.where(d['date_dow_name'].isin(['Sunday','Saturday']),1,0)

In [15]:
d.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [16]:
d['date_week'] = d['date'].dt.isocalendar().week
d['quarter']=d['date'].dt.quarter

In [17]:
d.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1

In [18]:
d['semester']=np.where(d['quarter'].isin([1,2]),1,2)
d.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

Extract Time elapsed between dates

In [19]:
import datetime
today=datetime.datetime.today()
today

datetime.datetime(2025, 12, 30, 16, 49, 38, 968920)

In [20]:
(today-d['date']).dt.days

0      2212
1      2694
2      2625
3      2327
4      2550
       ...
995    2640
996    2581
997    2429
998    2494
999    2268
Name: date, Length: 1000, dtype: int64

In [27]:
#months passed
np.round((today - d['date']).dt.days / 30.44, 0)

0      73.0
1      89.0
2      86.0
3      76.0
4      84.0
       ...
995    87.0
996    85.0
997    80.0
998    82.0
999    75.0
Name: date, Length: 1000, dtype: float64

In [29]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [30]:
#converting to datatime datatype
t['date']=pd.to_datetime(t['date'])
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [33]:
t['hour']=t['date'].dt.hour
t['min']=t['date'].dt.minute
t['sec']=t['date'].dt.second
t['time']=t['date'].dt.time
t.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [34]:
today - t['date']

0     4398 days 15:59:38.968920
1     4262 days 17:09:38.968920
2     4748 days 16:28:38.968920
3     4050 days 16:18:38.968920
4     4447 days 17:38:38.968920
                 ...
995   5037 days 15:59:38.968920
996   4358 days 17:35:38.968920
997   4823 days 17:12:38.968920
998   4939 days 17:15:38.968920
999   4211 days 17:24:38.968920
Name: date, Length: 1000, dtype: timedelta64[ns]

In [37]:
t['secound_passed']=(today-t['date'])/np.timedelta64(1,'s')
t.head()

,date,msg,hour,min,sec,time,secound_passed
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00,3.800448e+08
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00,3.682986e+08
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00,4.102865e+08
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00,3.499787e+08
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00,3.842843e+08

In [38]:
(today -t['date'])/np.timedelta64(1,'m')

0      6.334080e+06
1      6.138310e+06
2      6.838109e+06
3      5.832979e+06
4      6.404739e+06
           ...
995    7.254240e+06
996    6.276576e+06
997    6.946153e+06
998    7.113196e+06
999    6.064885e+06
Name: date, Length: 1000, dtype: float64

In [39]:
(today - t['date'])/np.timedelta64(1,'h')

0      105567.994158
1      102305.160825
2      113968.477491
3       97216.310825
4      106745.644158
           ...
995    120903.994158
996    104609.594158
997    115769.210825
998    118553.260825
999    101081.410825
Name: date, Length: 1000, dtype: float64